cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Tip: Populate current installed brews on this file from shell:
# $ brew list -1 | noglob awk '{print "brew '\''" $0 "'\''"}' >> Brewfile
brew 'ack'
brew 'autoconf'
brew 'coreutils'
brew 'grc'
brew 'jq'
brew 'memcached'
brew 'mysql@5.7'
brew 'node@8'
brew 'yarn'
brew 'nvm'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'ponysay'
brew 'rbenv'
brew 'readline'
brew 'ruby'
brew 'ruby-build'
brew 'siege'
brew 'spark'
brew 'tcpflow'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'

cask 'iterm2'
cask 'google-chrome'
cask 'spectacle'
cask 'karabiner-elements'
cask 'time-out'
cask 'firefox'
cask 'phpstorm'
cask 'intellij-idea-ce'
cask 'soapui'
cask 'spotify'
cask 'java'
cask 'slack'
cask 'docker'
# Missing: Monosnap
cask 'android-studio'
cask 'pycharm'
brew 'maven'
brew 'groovy'
